grevaillot/svd_tools/headers/STM32H750x/hrtim_timd.h
#pragma once 

/* --- HRTIM_TIMD: High Resolution Timer: TIMD ---------------------- */

/** @defgroup hrtim_timd_registers High Resolution Timer: TIMD Register
@{*/

/** HRTIM_TIMD_TIMDCR Timerx Control Register **/
#define HRTIM_TIMD_TIMDCR			MMIO32(HRTIM_TIMD_BASE + 0x00)
/** HRTIM_TIMD_TIMDISR Timerx Interrupt Status Register **/
#define HRTIM_TIMD_TIMDISR			MMIO32(HRTIM_TIMD_BASE + 0x04)
/** HRTIM_TIMD_TIMDICR Timerx Interrupt Clear Register **/
#define HRTIM_TIMD_TIMDICR			MMIO32(HRTIM_TIMD_BASE + 0x08)
/** HRTIM_TIMD_TIMDDIER5 TIMxDIER5 **/
#define HRTIM_TIMD_TIMDDIER5			MMIO32(HRTIM_TIMD_BASE + 0x0c)
/** HRTIM_TIMD_CNTDR Timerx Counter Register **/
#define HRTIM_TIMD_CNTDR			MMIO32(HRTIM_TIMD_BASE + 0x10)
/** HRTIM_TIMD_PERDR Timerx Period Register **/
#define HRTIM_TIMD_PERDR			MMIO32(HRTIM_TIMD_BASE + 0x14)
/** HRTIM_TIMD_REPDR Timerx Repetition Register **/
#define HRTIM_TIMD_REPDR			MMIO32(HRTIM_TIMD_BASE + 0x18)
/** HRTIM_TIMD_CMP1DR Timerx Compare 1 Register **/
#define HRTIM_TIMD_CMP1DR			MMIO32(HRTIM_TIMD_BASE + 0x1c)
/** HRTIM_TIMD_CMP1CDR Timerx Compare 1 Compound Register **/
#define HRTIM_TIMD_CMP1CDR			MMIO32(HRTIM_TIMD_BASE + 0x20)
/** HRTIM_TIMD_CMP2DR Timerx Compare 2 Register **/
#define HRTIM_TIMD_CMP2DR			MMIO32(HRTIM_TIMD_BASE + 0x24)
/** HRTIM_TIMD_CMP3DR Timerx Compare 3 Register **/
#define HRTIM_TIMD_CMP3DR			MMIO32(HRTIM_TIMD_BASE + 0x28)
/** HRTIM_TIMD_CMP4DR Timerx Compare 4 Register **/
#define HRTIM_TIMD_CMP4DR			MMIO32(HRTIM_TIMD_BASE + 0x2c)
/** HRTIM_TIMD_CPT1DR Timerx Capture 1 Register **/
#define HRTIM_TIMD_CPT1DR			MMIO32(HRTIM_TIMD_BASE + 0x30)
/** HRTIM_TIMD_CPT2DR Timerx Capture 2 Register **/
#define HRTIM_TIMD_CPT2DR			MMIO32(HRTIM_TIMD_BASE + 0x34)
/** HRTIM_TIMD_DTDR Timerx Deadtime Register **/
#define HRTIM_TIMD_DTDR			MMIO32(HRTIM_TIMD_BASE + 0x38)
/** HRTIM_TIMD_SETD1R Timerx Output1 Set Register **/
#define HRTIM_TIMD_SETD1R			MMIO32(HRTIM_TIMD_BASE + 0x3c)
/** HRTIM_TIMD_RSTD1R Timerx Output1 Reset Register **/
#define HRTIM_TIMD_RSTD1R			MMIO32(HRTIM_TIMD_BASE + 0x40)
/** HRTIM_TIMD_SETD2R Timerx Output2 Set Register **/
#define HRTIM_TIMD_SETD2R			MMIO32(HRTIM_TIMD_BASE + 0x44)
/** HRTIM_TIMD_RSTD2R Timerx Output2 Reset Register **/
#define HRTIM_TIMD_RSTD2R			MMIO32(HRTIM_TIMD_BASE + 0x48)
/** HRTIM_TIMD_EEFDR1 Timerx External Event Filtering Register 1 **/
#define HRTIM_TIMD_EEFDR1			MMIO32(HRTIM_TIMD_BASE + 0x4c)
/** HRTIM_TIMD_EEFDR2 Timerx External Event Filtering Register 2 **/
#define HRTIM_TIMD_EEFDR2			MMIO32(HRTIM_TIMD_BASE + 0x50)
/** HRTIM_TIMD_RSTDR TimerA Reset Register **/
#define HRTIM_TIMD_RSTDR			MMIO32(HRTIM_TIMD_BASE + 0x54)
/** HRTIM_TIMD_CHPDR Timerx Chopper Register **/
#define HRTIM_TIMD_CHPDR			MMIO32(HRTIM_TIMD_BASE + 0x58)
/** HRTIM_TIMD_CPT1DCR Timerx Capture 2 Control Register **/
#define HRTIM_TIMD_CPT1DCR			MMIO32(HRTIM_TIMD_BASE + 0x5c)
/** HRTIM_TIMD_CPT2DCR CPT2xCR **/
#define HRTIM_TIMD_CPT2DCR			MMIO32(HRTIM_TIMD_BASE + 0x60)
/** HRTIM_TIMD_OUTDR Timerx Output Register **/
#define HRTIM_TIMD_OUTDR			MMIO32(HRTIM_TIMD_BASE + 0x64)
/** HRTIM_TIMD_FLTDR Timerx Fault Register **/
#define HRTIM_TIMD_FLTDR			MMIO32(HRTIM_TIMD_BASE + 0x68)

/**@}*/


/** @defgroup hrtim_timd_timdcr TIMDCR Timerx Control Register
@{*/


#define HRTIM_TIMD_TIMDCR_UPDGAT_SHIFT		28
#define HRTIM_TIMD_TIMDCR_UPDGAT_MASK		0x0f
/** @defgroup hrtim_timd_timdcr_updgat UPDGAT Update Gating
@{*/
/**@}*/

/** HRTIM_TIMD_TIMDCR_PREEN Preload enable **/
#define HRTIM_TIMD_TIMDCR_PREEN		(1 << 27)

#define HRTIM_TIMD_TIMDCR_DACSYNC_SHIFT		25
#define HRTIM_TIMD_TIMDCR_DACSYNC_MASK		0x03
/** @defgroup hrtim_timd_timdcr_dacsync DACSYNC AC Synchronization
@{*/
/**@}*/

/** HRTIM_TIMD_TIMDCR_MSTU Master Timer update **/
#define HRTIM_TIMD_TIMDCR_MSTU		(1 << 24)
/** HRTIM_TIMD_TIMDCR_TEU TEU **/
#define HRTIM_TIMD_TIMDCR_TEU		(1 << 23)
/** HRTIM_TIMD_TIMDCR_TDU TDU **/
#define HRTIM_TIMD_TIMDCR_TDU		(1 << 22)
/** HRTIM_TIMD_TIMDCR_TCU TCU **/
#define HRTIM_TIMD_TIMDCR_TCU		(1 << 21)
/** HRTIM_TIMD_TIMDCR_TBU TBU **/
#define HRTIM_TIMD_TIMDCR_TBU		(1 << 20)
/** HRTIM_TIMD_TIMDCR_TxRSTU Timerx reset update **/
#define HRTIM_TIMD_TIMDCR_TxRSTU		(1 << 18)
/** HRTIM_TIMD_TIMDCR_TxREPU Timer x Repetition update **/
#define HRTIM_TIMD_TIMDCR_TxREPU		(1 << 17)

#define HRTIM_TIMD_TIMDCR_DELCMP4_SHIFT		14
#define HRTIM_TIMD_TIMDCR_DELCMP4_MASK		0x03
/** @defgroup hrtim_timd_timdcr_delcmp4 DELCMP4 Delayed CMP4 mode
@{*/
/**@}*/


#define HRTIM_TIMD_TIMDCR_DELCMP2_SHIFT		12
#define HRTIM_TIMD_TIMDCR_DELCMP2_MASK		0x03
/** @defgroup hrtim_timd_timdcr_delcmp2 DELCMP2 Delayed CMP2 mode
@{*/
/**@}*/

/** HRTIM_TIMD_TIMDCR_SYNCSTRTx Synchronization Starts Timer x **/
#define HRTIM_TIMD_TIMDCR_SYNCSTRTx		(1 << 11)
/** HRTIM_TIMD_TIMDCR_SYNCRSTx Synchronization Resets Timer x **/
#define HRTIM_TIMD_TIMDCR_SYNCRSTx		(1 << 10)
/** HRTIM_TIMD_TIMDCR_PSHPLL Push-Pull mode enable **/
#define HRTIM_TIMD_TIMDCR_PSHPLL		(1 << 6)
/** HRTIM_TIMD_TIMDCR_HALF Half mode enable **/
#define HRTIM_TIMD_TIMDCR_HALF		(1 << 5)
/** HRTIM_TIMD_TIMDCR_RETRIG Re-triggerable mode **/
#define HRTIM_TIMD_TIMDCR_RETRIG		(1 << 4)
/** HRTIM_TIMD_TIMDCR_CONT Continuous mode **/
#define HRTIM_TIMD_TIMDCR_CONT		(1 << 3)

#define HRTIM_TIMD_TIMDCR_CK_PSCx_SHIFT		0
#define HRTIM_TIMD_TIMDCR_CK_PSCx_MASK		0x07
/** @defgroup hrtim_timd_timdcr_ck_pscx CKPSCx HRTIM Timer x Clock prescaler
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timd_timdisr TIMDISR Timerx Interrupt Status Register
@{*/

/** HRTIM_TIMD_TIMDISR_O2STAT Output 2 State **/
#define HRTIM_TIMD_TIMDISR_O2STAT		(1 << 19)
/** HRTIM_TIMD_TIMDISR_O1STAT Output 1 State **/
#define HRTIM_TIMD_TIMDISR_O1STAT		(1 << 18)
/** HRTIM_TIMD_TIMDISR_IPPSTAT Idle Push Pull Status **/
#define HRTIM_TIMD_TIMDISR_IPPSTAT		(1 << 17)
/** HRTIM_TIMD_TIMDISR_CPPSTAT Current Push Pull Status **/
#define HRTIM_TIMD_TIMDISR_CPPSTAT		(1 << 16)
/** HRTIM_TIMD_TIMDISR_DLYPRT Delayed Protection Flag **/
#define HRTIM_TIMD_TIMDISR_DLYPRT		(1 << 14)
/** HRTIM_TIMD_TIMDISR_RST Reset Interrupt Flag **/
#define HRTIM_TIMD_TIMDISR_RST		(1 << 13)
/** HRTIM_TIMD_TIMDISR_RSTx2 Output 2 Reset Interrupt Flag **/
#define HRTIM_TIMD_TIMDISR_RSTx2		(1 << 12)
/** HRTIM_TIMD_TIMDISR_SETx2 Output 2 Set Interrupt Flag **/
#define HRTIM_TIMD_TIMDISR_SETx2		(1 << 11)
/** HRTIM_TIMD_TIMDISR_RSTx1 Output 1 Reset Interrupt Flag **/
#define HRTIM_TIMD_TIMDISR_RSTx1		(1 << 10)
/** HRTIM_TIMD_TIMDISR_SETx1 Output 1 Set Interrupt Flag **/
#define HRTIM_TIMD_TIMDISR_SETx1		(1 << 9)
/** HRTIM_TIMD_TIMDISR_CPT2 Capture2 Interrupt Flag **/
#define HRTIM_TIMD_TIMDISR_CPT2		(1 << 8)
/** HRTIM_TIMD_TIMDISR_CPT1 Capture1 Interrupt Flag **/
#define HRTIM_TIMD_TIMDISR_CPT1		(1 << 7)
/** HRTIM_TIMD_TIMDISR_UPD Update Interrupt Flag **/
#define HRTIM_TIMD_TIMDISR_UPD		(1 << 6)
/** HRTIM_TIMD_TIMDISR_REP Repetition Interrupt Flag **/
#define HRTIM_TIMD_TIMDISR_REP		(1 << 4)
/** HRTIM_TIMD_TIMDISR_CMP4 Compare 4 Interrupt Flag **/
#define HRTIM_TIMD_TIMDISR_CMP4		(1 << 3)
/** HRTIM_TIMD_TIMDISR_CMP3 Compare 3 Interrupt Flag **/
#define HRTIM_TIMD_TIMDISR_CMP3		(1 << 2)
/** HRTIM_TIMD_TIMDISR_CMP2 Compare 2 Interrupt Flag **/
#define HRTIM_TIMD_TIMDISR_CMP2		(1 << 1)
/** HRTIM_TIMD_TIMDISR_CMP1 Compare 1 Interrupt Flag **/
#define HRTIM_TIMD_TIMDISR_CMP1		(1 << 0)

/**@}*/

/** @defgroup hrtim_timd_timdicr TIMDICR Timerx Interrupt Clear Register
@{*/

/** HRTIM_TIMD_TIMDICR_DLYPRTC Delayed Protection Flag Clear **/
#define HRTIM_TIMD_TIMDICR_DLYPRTC		(1 << 14)
/** HRTIM_TIMD_TIMDICR_RSTC Reset Interrupt flag Clear **/
#define HRTIM_TIMD_TIMDICR_RSTC		(1 << 13)
/** HRTIM_TIMD_TIMDICR_RSTx2C Output 2 Reset flag Clear **/
#define HRTIM_TIMD_TIMDICR_RSTx2C		(1 << 12)
/** HRTIM_TIMD_TIMDICR_SET2xC Output 2 Set flag Clear **/
#define HRTIM_TIMD_TIMDICR_SET2xC		(1 << 11)
/** HRTIM_TIMD_TIMDICR_RSTx1C Output 1 Reset flag Clear **/
#define HRTIM_TIMD_TIMDICR_RSTx1C		(1 << 10)
/** HRTIM_TIMD_TIMDICR_SET1xC Output 1 Set flag Clear **/
#define HRTIM_TIMD_TIMDICR_SET1xC		(1 << 9)
/** HRTIM_TIMD_TIMDICR_CPT2C Capture2 Interrupt flag Clear **/
#define HRTIM_TIMD_TIMDICR_CPT2C		(1 << 8)
/** HRTIM_TIMD_TIMDICR_CPT1C Capture1 Interrupt flag Clear **/
#define HRTIM_TIMD_TIMDICR_CPT1C		(1 << 7)
/** HRTIM_TIMD_TIMDICR_UPDC Update Interrupt flag Clear **/
#define HRTIM_TIMD_TIMDICR_UPDC		(1 << 6)
/** HRTIM_TIMD_TIMDICR_REPC Repetition Interrupt flag Clear **/
#define HRTIM_TIMD_TIMDICR_REPC		(1 << 4)
/** HRTIM_TIMD_TIMDICR_CMP4C Compare 4 Interrupt flag Clear **/
#define HRTIM_TIMD_TIMDICR_CMP4C		(1 << 3)
/** HRTIM_TIMD_TIMDICR_CMP3C Compare 3 Interrupt flag Clear **/
#define HRTIM_TIMD_TIMDICR_CMP3C		(1 << 2)
/** HRTIM_TIMD_TIMDICR_CMP2C Compare 2 Interrupt flag Clear **/
#define HRTIM_TIMD_TIMDICR_CMP2C		(1 << 1)
/** HRTIM_TIMD_TIMDICR_CMP1C Compare 1 Interrupt flag Clear **/
#define HRTIM_TIMD_TIMDICR_CMP1C		(1 << 0)

/**@}*/

/** @defgroup hrtim_timd_timddier5 TIMDDIER5 TIMxDIER5
@{*/

